; domain
(define (domain overcooked)
  (:requirements :adl :typing :equality)
  (:types
    location - object ; Locations of objects and the agent
    food receptacle tool - item ; Objects that can be held and moved
    appliance - object ; Appliances that can be used to combine or cook food
    ftype rtype ttype atype - type ; Food, receptacle, tool and appliance types
    prepare-method combine-method cook-method - method ; Methods for cooking, etc
  )
  (:predicates
    ;; Static predicates

    ; Whether food ingredient ?f is of type ?ty
    (food-type ?ty - ftype ?f - food)
    ; Whether receptacle ?r is of type ?ty
    (receptacle-type ?ty - rtype ?r - receptacle)
    ; Whether tool ?t is of type ?ty
    (tool-type ?t - ttype ?t - tool)
    ; Whether appliance ?a has type ?ty
    (appliance-type ?ty - atype ?a - appliance)

    ; Whether ?r-typed receptacle and ?t-typed tool can prepare via method ?m
    (has-prepare-method ?m - prepare-method ?r - rtype ?t - ttype)
    ; Whether ?r-typed receptacle and ?a-typed appliance can combine via method ?m
    (has-combine-method ?m - combine-method ?r - rtype ?a - atype)
    ; Whether ?r-typed receptacle and ?a-typed appliance can cook via method ?m
    (has-cook-method ?m - cook-method ?r - rtype ?a - atype)

    ;; Dynamic predicates

    ; Whether agent is at location ?l
    (agent-at-loc ?l - location)
    ; Whether object is at location ?l
    (object-at-loc ?o - object ?l - location)

    ; Whether the agent is not holding anything
    (handempty)
    ; Whether the agent is holding item ?i
    (holding ?i - item)

    ; Whether food item ?i is in or on receptacle ?r
    (in-receptacle ?i - food ?r - receptacle)
    ; Whether item ?i is in or on appliance ?a
    (in-appliance ?i - item ?a - appliance)
    ; Whether appliance ?a is occupied
    (occupied ?a - appliance)

    ; Whether food item ?f is prepared
    (is-prepared ?f - food)
    ; Whether food item ?f was prepared using method ?m
    (prepared ?m - prepare-method ?f - food)

    ; Whether food item ?f is combined
    (is-combined ?f - food)
    ; Whether food item ?f was combined using method ?m
    (combined ?m - combine-method ?f - food)
    ; Whether food items ?f1 and ?f2 were combined together using method ?m
    (combined-with ?m - combine-method ?f1 ?f2 - food)

    ; Whether food item ?f is cooked
    (is-cooked ?f - food)
    ; Whether food item ?f was cooked using method ?m
    (cooked ?m - cook-method ?f - food)
    ; Whether food items ?f1 and ?f2 were cooked together using method ?m
    (cooked-with ?m - cook-method ?f1 ?f2 - food)
  )

  ; Move from location ?l1 to location ?l2
  (:action move
   :parameters (?l1 ?l2 - location)
   :precondition (agent-at-loc ?l1)
   :effect (and (agent-at-loc ?l2) (not (agent-at-loc ?l1)))
  )

  ; Pick up item ?i at location ?l
  (:action pick-up
   :parameters (?i - item ?l - location)
   :precondition (and (handempty) (agent-at-loc ?l) (object-at-loc ?i ?l))
   :effect (and (holding ?i) (not (object-at-loc ?i ?l)) (not (handempty))
                (forall (?a - appliance)
                        (when (object-at-loc ?a ?l)
                              (and (not (occupied ?a))
                                   (not (in-appliance ?i ?a))))))
  )

  ; Put down item ?i at location ?l
  (:action put-down
   :parameters (?i - item ?l - location)
   :precondition (and (agent-at-loc ?l) (holding ?i)
                      (forall (?a - appliance)
                              (imply (object-at-loc ?a ?l) (not (occupied ?a)))))
   :effect (and (handempty) (object-at-loc ?i ?l) (not (holding ?i))
                (forall (?a - appliance)
                        (when (object-at-loc ?a ?l)
                              (and (occupied ?a) (in-appliance ?i ?a)))))
  )

  ; Take out food item ?i in receptacle ?r at location ?l
  (:action take-out
   :parameters (?i - food ?r - receptacle ?l - location)
   :precondition (and (handempty) (in-receptacle ?i ?r)
                      (agent-at-loc ?l) (object-at-loc ?r ?l)
                      (not (is-combined ?i)) (not (is-cooked ?i)))
   :effect (and (holding ?i) (not (in-receptacle ?i ?r)) (not (handempty)))
  )

  ; Place food item ?i in receptacle ?r at location ?l
  (:action place-in
   :parameters (?i - food ?r - receptacle ?l - location)
   :precondition (and (holding ?i) (agent-at-loc ?l) (object-at-loc ?r ?l))
   :effect (and (handempty) (in-receptacle ?i ?r) (not (holding ?i)))
  )

  ; Transfer all items in held receptacle ?src to receptacle ?dst at location ?l
  (:action transfer
   :parameters (?src ?dst - receptacle ?l - location)
   :precondition (and (holding ?src) (agent-at-loc ?l) (object-at-loc ?dst ?l)
                      (not (= ?src ?dst)))
   :effect (forall (?i - item)
                   (when (in-receptacle ?i ?src)
                         (and (in-receptacle ?i ?dst)
                              (not (in-receptacle ?i ?src)))))
  )

  ; Prepare a piece of food ?f in receptacle ?r using tool ?t via method ?m
  (:action prepare
   :parameters (?m - prepare-method ?r - receptacle ?t - tool
                ?f - food ?l - location)
   :precondition (and (holding ?t) (in-receptacle ?f ?r)
                      (agent-at-loc ?l) (object-at-loc ?r ?l)
                      (not (is-prepared ?f)) (not (is-combined ?f))
                      (not (is-cooked ?f))
                      (exists (?rt - rtype ?tt - ttype)
                              (and (receptacle-type ?rt ?r)
                                   (tool-type ?tt ?t)
                                   (has-prepare-method ?m ?rt ?tt))))
   :effect (and (is-prepared ?f) (prepared ?m ?f))
  )

  ; Combine ingredients in receptacle ?r using appliance ?a via method ?m
  (:action combine
   :parameters (?m - combine-method ?r - receptacle ?a - appliance ?l - location)
   :precondition (and (in-appliance ?r ?a)
                      (agent-at-loc ?l) (object-at-loc ?a ?l)
                      (exists (?rt - rtype ?at - atype)
                              (and (receptacle-type ?rt ?r)
                                   (appliance-type ?at ?a)
                                   (has-combine-method ?m ?rt ?at)))
                      (forall (?f - food)
                              (imply (in-receptacle ?f ?r)
                                     (and (not (is-combined ?f))
                                           (not (is-cooked ?f))))))
   :effect (forall (?f - food)
                    (when (in-receptacle ?f ?r)
                          (and (is-combined ?f) (combined ?m ?f)
                          )))
                          ;     (forall (?f2 - food)
                          ;            (when (and (in-receptacle ?f2 ?r)
                          ;                       (not (= ?f ?f2)))
                          ;                  (combined-with ?m ?f ?f2))))))
  )

  ; Cook ingredients in receptacle ?r using appliance ?a via method ?m
  (:action cook
   :parameters (?m - cook-method ?r - receptacle ?a - appliance ?l - location)
   :precondition (and (in-appliance ?r ?a)
                      (agent-at-loc ?l) (object-at-loc ?a ?l)
                      (exists (?rt - rtype ?at - atype)
                              (and (receptacle-type ?rt ?r)
                                   (appliance-type ?at ?a)
                                   (has-cook-method ?m ?rt ?at)))
                      (forall (?f - food)
                              (imply (in-receptacle ?f ?r)
                                     (not (is-cooked ?f)))))
   :effect (forall (?f - food)
                    (when (in-receptacle ?f ?r)
                          (and (is-cooked ?f) (cooked ?m ?f)
                          )))
                          ;     (forall (?f2 - food)
                          ;            (when (and (in-receptacle ?f2 ?r)
                          ;                        (not (= ?f ?f2)))
                          ;                  (cooked-with ?m ?f ?f2))))))
  )

)

; problem
; Delicatessen
(define (problem overcooked-problem-3-2)
    (:domain overcooked)
    (:objects
        ham bread cheese beef chicken onion potato bacon lettuce tomato mayo - ftype ; Food types
        chopping-board basket pan plate - rtype ; Receptacle types
        knife - ttype ; Tool types
        stove deep-fryer - atype ; Appliance types
        slice chop mince - prepare-method ; Preparation methods
        grill fry - cook-method ; Cooking methods
        ham1 bread1 cheese1 beef1 chicken1 onion1 potato1 bacon1 lettuce1 tomato1 mayo1 - food ; Food objects
        board1 basket1 pan1 plate1 - receptacle ; Receptacle objects
        knife1 - tool ; Tool objects
        stove1 fryer1 - appliance ; Appliance objects
        start-loc food-loc chop-loc fryer-loc stove-loc plate-loc - location ; Locations
    )
    (:init
        ; Type declarations
        (food-type ham ham1)
        (food-type beef beef1)
        (food-type cheese cheese1)
        (food-type onion onion1)
        (food-type potato potato1)
        (food-type chicken chicken1)
        (food-type bacon bacon1)
        (food-type lettuce lettuce1)
        (food-type tomato tomato1)
        (food-type bread bread1)
        (receptacle-type chopping-board board1)
        (receptacle-type plate plate1)
        (receptacle-type pan pan1)
        (tool-type knife knife1)
        (appliance-type stove stove1)
        (appliance-type deep-fryer fryer1)
        ; Method declarations
        (has-prepare-method slice chopping-board knife)
        (has-prepare-method mince chopping-board knife)
        (has-prepare-method chop chopping-board knife)
        (has-cook-method grill pan stove)
        (has-cook-method fry pan stove)
        (has-cook-method fry basket deep-fryer)
        ; Initial agent state
        (handempty)
        (agent-at-loc start-loc)
        ; Initial food locations
        (object-at-loc bread1 food-loc)
        (object-at-loc ham1 food-loc)
        (object-at-loc cheese1 food-loc)
        (object-at-loc beef1 food-loc)
        (object-at-loc onion1 food-loc)
        (object-at-loc potato1 food-loc)
        (object-at-loc chicken1 food-loc)
        (object-at-loc bacon1 food-loc)
        (object-at-loc lettuce1 food-loc)
        (object-at-loc tomato1 food-loc)
        (object-at-loc mayo1 food-loc)
        ; Receptacle, tool, and appliance locations
        (object-at-loc board1 chop-loc)
        (object-at-loc knife1 chop-loc)
        (object-at-loc pan1 stove-loc)
        (object-at-loc stove1 stove-loc)
        (object-at-loc plate1 plate-loc)
        (object-at-loc fryer1 fryer-loc)
        ; Whether receptacles are located on appliances
        (in-appliance pan1 stove1)
        (occupied stove1)
    )
    (:goal
        (exists (?ham - food ?bread - food ?cheese - food ?plate - receptacle)
                (and (food-type bread ?bread)
                     (food-type ham ?ham)
                     (food-type cheese ?cheese)
                     (receptacle-type plate ?plate)
                     (prepared slice ?ham)
                     (prepared slice ?cheese)
                     (in-receptacle ?ham ?plate)
                     (in-receptacle ?bread ?plate)
                     (in-receptacle ?cheese ?plate)))
    )
)

; plan
1. (move start-loc food-loc)
   deleted: (agent-at-loc start-loc)
   added: (agent-at-loc food-loc)
   goals met: 0 of 1
2. (pick-up ham1 food-loc)
   deleted: (object-at-loc ham1 food-loc) (handempty)
   added: (holding ham1)
   goals met: 0 of 1
3. (move food-loc chop-loc)
   deleted: (agent-at-loc food-loc)
   added: (agent-at-loc chop-loc)
   goals met: 0 of 1
4. (place-in ham1 board1 chop-loc)
   deleted: (holding ham1)
   added: (handempty) (in-receptacle ham1 board1)
   goals met: 0 of 1
5. (move chop-loc food-loc)
   deleted: (agent-at-loc chop-loc)
   added: (agent-at-loc food-loc)
   goals met: 0 of 1
6. (pick-up cheese1 food-loc)
   deleted: (object-at-loc cheese1 food-loc) (handempty)
   added: (holding cheese1)
   goals met: 0 of 1
7. (move food-loc chop-loc)
   deleted: (agent-at-loc food-loc)
   added: (agent-at-loc chop-loc)
   goals met: 0 of 1
8. (place-in cheese1 board1 chop-loc)
   deleted: (holding cheese1)
   added: (handempty) (in-receptacle cheese1 board1)
   goals met: 0 of 1
9. (pick-up knife1 chop-loc)
   deleted: (object-at-loc knife1 chop-loc) (handempty)
   added: (holding knife1)
   goals met: 0 of 1
10. (prepare slice board1 knife1 ham1 chop-loc)
   added: (is-prepared ham1) (prepared slice ham1)
   goals met: 0 of 1
11. (prepare slice board1 knife1 cheese1 chop-loc)
   added: (is-prepared cheese1) (prepared slice cheese1)
   goals met: 0 of 1
12. (put-down knife1 chop-loc)
   deleted: (holding knife1)
   added: (handempty) (object-at-loc knife1 chop-loc)
   goals met: 0 of 1
13. (move chop-loc food-loc)
   deleted: (agent-at-loc chop-loc)
   added: (agent-at-loc food-loc)
   goals met: 0 of 1
14. (pick-up bread1 food-loc)
   deleted: (object-at-loc bread1 food-loc) (handempty)
   added: (holding bread1)
   goals met: 0 of 1
15. (move food-loc stove-loc)
   deleted: (agent-at-loc food-loc)
   added: (agent-at-loc stove-loc)
   goals met: 0 of 1
16. (place-in bread1 pan1 stove-loc)
   deleted: (holding bread1)
   added: (handempty) (in-receptacle bread1 pan1)
   goals met: 0 of 1
17. (move stove-loc chop-loc)
   deleted: (agent-at-loc stove-loc)
   added: (agent-at-loc chop-loc)
   goals met: 0 of 1
18. (pick-up board1 chop-loc)
   deleted: (object-at-loc board1 chop-loc) (handempty)
   added: (holding board1)
   goals met: 0 of 1
19. (move chop-loc stove-loc)
   deleted: (agent-at-loc chop-loc)
   added: (agent-at-loc stove-loc)
   goals met: 0 of 1
20. (transfer board1 pan1 stove-loc)
   deleted: (in-receptacle ham1 board1) (in-receptacle cheese1 board1)
   added: (in-receptacle ham1 pan1) (in-receptacle cheese1 pan1)
   goals met: 0 of 1
21. (cook grill pan1 stove1 stove-loc)
   added: (is-cooked ham1) (cooked grill ham1) (is-cooked bread1) (cooked grill bread1) (is-cooked cheese1) (cooked grill cheese1)
   goals met: 0 of 1
22. (move stove-loc chop-loc)
   deleted: (agent-at-loc stove-loc)
   added: (agent-at-loc chop-loc)
   goals met: 0 of 1
23. (put-down board1 chop-loc)
   deleted: (holding board1)
   added: (handempty) (object-at-loc board1 chop-loc)
   goals met: 0 of 1
24. (move chop-loc stove-loc)
   deleted: (agent-at-loc chop-loc)
   added: (agent-at-loc stove-loc)
   goals met: 0 of 1
25. (pick-up pan1 stove-loc)
   deleted: (object-at-loc pan1 stove-loc) (handempty) (occupied stove1) (in-appliance pan1 stove1)
   added: (holding pan1)
   goals met: 0 of 1
26. (move stove-loc plate-loc)
   deleted: (agent-at-loc stove-loc)
   added: (agent-at-loc plate-loc)
   goals met: 0 of 1
27. (transfer pan1 plate1 plate-loc)
   deleted: (in-receptacle ham1 pan1) (in-receptacle bread1 pan1) (in-receptacle cheese1 pan1)
   added: (in-receptacle ham1 plate1) (in-receptacle bread1 plate1) (in-receptacle cheese1 plate1)
   goals met: 1 of 1
